Revit 2024 API
ConnectionValidationWarning Methods
The ConnectionValidationWarning type exposes the following members.
Methods
Name | Description
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetParts
 Get ElementIds of affected parts.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
ConnectionValidationWarning Class
Autodesk.Revit.DB Namespace